It seems to be working for me.

Using this code:
```terraform
module "cluster-1" {
  source     = "./fabric/modules/gke-cluster-standard"
  project_id = "my-project-xxxxx"
  name       = "cluster-1-xxxx"
  location   = "europe-west1-b"
  vpc_config = {
    network               = "aaa"
    subnetwork            = "bbb"
    secondary_range_names = {}
  }
  cluster_autoscaling = {
    auto_provisioning_defaults = {
      boot_disk_kms_key = "my-key"
      disk_size         = 999
      service_account   = "my-sa"
      oauth_scopes = [
        "https://www.googleapis.com/auth/devstorage.read_only",
        "https://www.googleapis.com/auth/logging.write",
        "https://www.googleapis.com/auth/monitoring",
        "https://www.googleapis.com/auth/monitoring.write",
        "https://www.googleapis.com/auth/userinfo.email"
      ]
      shielded_instance_config = {
        secure_boot = true
      }
      upgrade_settings = {
        surge = {
          max         = 222
          unavailable = 333
        }
      }
    }
  }
}
```

I get this plan:
```
Terraform will perform the following actions:

  # module.cluster-1.google_container_cluster.cluster will be created
  + resource "google_container_cluster" "cluster" {
      + cluster_ipv4_cidr           = (known after apply)
      + datapath_provider           = (known after apply)
      + default_max_pods_per_node   = 110
      + deletion_protection         = true
      + enable_fqdn_network_policy  = false
      + enable_intranode_visibility = false
      + enable_kubernetes_alpha     = false
      + enable_l4_ilb_subsetting    = false
      + enable_legacy_abac          = false
      + enable_multi_networking     = false
      + enable_shielded_nodes       = false
      + enable_tpu                  = false
      + endpoint                    = (known after apply)
      + id                          = (known after apply)
      + initial_node_count          = 1
      + label_fingerprint           = (known after apply)
      + location                    = "europe-west1-b"
      + logging_service             = (known after apply)
      + master_version              = (known after apply)
      + monitoring_service          = (known after apply)
      + name                        = "cluster-1-xxxx"
      + network                     = "aaa"
      + networking_mode             = (known after apply)
      + node_locations              = (known after apply)
      + node_version                = (known after apply)
      + operation                   = (known after apply)
      + private_ipv6_google_access  = (known after apply)
      + project                     = "my-project-xxxxx"
      + remove_default_node_pool    = true
      + self_link                   = (known after apply)
      + services_ipv4_cidr          = (known after apply)
      + subnetwork                  = "bbb"
      + tpu_ipv4_cidr_block         = (known after apply)

      + addons_config {
          + cloudrun_config {
              + disabled = true
            }
          + config_connector_config {
              + enabled = false
            }
          + dns_cache_config {
              + enabled = false
            }
          + gce_persistent_disk_csi_driver_config {
              + enabled = false
            }
          + gcp_filestore_csi_driver_config {
              + enabled = false
            }
          + gcs_fuse_csi_driver_config {
              + enabled = false
            }
          + gke_backup_agent_config {
              + enabled = false
            }
          + horizontal_pod_autoscaling {
              + disabled = false
            }
          + http_load_balancing {
              + disabled = false
            }
          + istio_config {
              + disabled = true
            }
          + kalm_config {
              + enabled = false
            }
          + network_policy_config {
              + disabled = true
            }
        }

      + cluster_autoscaling {
          + autoscaling_profile = "BALANCED"
          + enabled             = true

          + auto_provisioning_defaults {
              + boot_disk_kms_key = "my-key"
              + disk_size         = 999
              + disk_type         = "pd-standard"
              + image_type        = "COS_CONTAINERD"
              + oauth_scopes      = [
                  + "https://www.googleapis.com/auth/devstorage.read_only",
                  + "https://www.googleapis.com/auth/logging.write",
                  + "https://www.googleapis.com/auth/monitoring",
                  + "https://www.googleapis.com/auth/monitoring.write",
                  + "https://www.googleapis.com/auth/userinfo.email",
                ]
              + service_account   = "my-sa"

              + shielded_instance_config {
                  + enable_integrity_monitoring = true
                  + enable_secure_boot          = true
                }

              + upgrade_settings {
                  + max_surge       = 222
                  + max_unavailable = 333
                  + strategy        = "SURGE"
                }
            }
        }

      + ip_allocation_policy {
          + cluster_ipv4_cidr_block       = (known after apply)
          + cluster_secondary_range_name  = "pods"
          + services_ipv4_cidr_block      = (known after apply)
          + services_secondary_range_name = "services"
          + stack_type                    = "IPV4"
        }

      + logging_config {
          + enable_components = [
              + "SYSTEM_COMPONENTS",
            ]
        }

      + maintenance_policy {
          + daily_maintenance_window {
              + duration   = (known after apply)
              + start_time = "03:00"
            }
        }

      + master_auth {
          + client_certificate     = (known after apply)
          + client_key             = (sensitive value)
          + cluster_ca_certificate = (known after apply)

          + client_certificate_config {
              + issue_client_certificate = false
            }
        }

      + monitoring_config {
          + enable_components = [
              + "SYSTEM_COMPONENTS",
            ]

          + managed_prometheus {
              + enabled = true
            }
        }

      + node_config {
          + disk_size_gb      = (known after apply)
          + disk_type         = (known after apply)
          + effective_taints  = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + logging_variant   = (known after apply)
          + machine_type      = (known after apply)
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = (known after apply)
          + preemptible       = false
          + service_account   = (known after apply)
          + spot              = false
        }

      + node_pool_defaults {
          + node_config_defaults {
              + logging_variant = (known after apply)

              + gcfs_config {
                  + enabled = false
                }
            }
        }

      + workload_identity_config {
          + workload_pool = "my-project-xxxxx.svc.id.goog"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

which looks OK to me.

Perhaps you're creating more than one cluster and you're looking at the wrong resource?